cask_args appdir: '/Applications'

# tap repositories and their packages

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'argon/mas'
tap 'd12frosted/emacs-plus'

# Other Homebrew packages
brew 'mas'
brew 'ack'
brew 'autoconf'
brew 'automake'
brew 'cairo'
brew 'elixir'
brew 'emacs-plus', args: ["--with-cocoa","--with-ctags","--with-glib", "--with-gnutls", "--with-imagemagick", "--with-librsvg"]      
brew 'erlang'
brew 'git'
brew 'heroku'
brew 'leiningen'
brew 'libcroco'
brew 'mtr'
brew 'openssl'
brew 'pcre'
brew 'rbenv'
brew 'ruby-build'
brew 'tmux'
brew 'unrar'
brew 'postgresql'
brew 'watch'
brew 'wget'
brew 'wxmac'
brew 'xz'
brew 'zsh'

cask 'skype'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'docker'
cask 'franz'
cask 'adium'
cask 'dropbox'
cask 'spotify'
cask 'sonos' 
cask 'ngrok' 
cask 'rescuetime'
cask 'ynab'
cask 'vagrant'
cask 'virtualbox'
cask 'heroku'
cask 'java'
cask 'flux'
cask 'vlc'
cask 'toggldesktop'

mas '1Password', id: 443987910 
mas 'Evernote', id: 406056744
mas 'LastPass', id: 926036361
mas 'Slack', id: 803453959
mas 'Telegram', id: 747648890



